// Задача 9

// Строка состоит из слов, разделенных одним или несколькими пробелами и знаками препинания.
// (+) Во всех подзадачах маленькие и больше буквы считать одинаковыми
// (+) Найдите слово наибольшей длины.
// (+) Определить какая буква в строке встречается чаще всего
// (+) Вывести в алфавитном порядке все слова, содержащие наибольшее количество гласных букв
// (+) Найти все слова, в которые буква «а» входит не менее двух раз
// (+) Вывести текст, составленный из первых букв всех слов содержащих букву «и».
// (+) Вывести слова, в которых нет повторяющихся букв

"user strict";

const str =
  "Объектно-ориентированное   программирование (ООП) —   методология программирования, основанная на   представлении программы в виде совокупности    объектов, каждый из которых является   экземпляром определённого класса, а классы    образуют иерархию наследования";
