"use strict";

// Задача 1
// Выведите на экран числа 1, 2, 3, 4, ..., 20
// Выведите на экран числа -1, -2, -3, -4, ..., -20
// Вывести на экран числа 100, 96, 92, ... до последнего положительного включительно.

//let n = +prompt("введите число: ");

let i1 = "";
let i2 = "";
let i3 = "";

for (let i = 1; i <= 20; i++) {
  i1 += i + ", ";
}

for (let i = -1; i >= -20; i--) {
  i2 += i + ", ";
}

for (let i = 100; i > 0; i = i - 4) {
  i3 += i + ", ";
}

console.log(i1);
console.log(i2);
console.log(i3);
