"use strict";

// Домашнее задание №1  на 6 января

let c = +prompt("введите с: ");
console.log(
  3 +
    ((28 * c) / (c ** 2 - 49) + (c - 7) / (c + 7)) * (c / (c + 7)) -
    c / (c - 7)
);

// let a1 = (28 * c) / (c ** 2 - 49);
// let a2 = (c - 7) / (c + 7);
// let a3 = c / (c + 7);
// let a4 = c / (c - 7);

// let b = 3 + (a1 + a2) * a3 - a4;

// console.log(b, " =  ", "3 + (", a1, "+", a2, " ) ", " * ", a3, " - ", a4);
let x = +prompt("введите x: ");
console.log(4.5 + (25 * x ** 2 - 4 ** -1) / (5 * x + 2 ** -1) - 3 * x); //2 => 8

let a = +prompt("введите a: ");
console.log(
  (2 * a - 2) / (a - 2) +
    1 -
    ((8 * a) / (a ** 2 - 4) + ((a - 2) / (a + 2)) * (a / (a + 2)))
); //2 => 8

// Домашнее задание №2 на 6 января
