// Задача 4
// Реализуйте функции конструктор для Student и Aspirant, аспирант отличается от студента наличием некой научной работы.

// Student содержит свойства:

// firstName
// lastName
// group
// averageMark (содержащую среднюю оценку).
// Aspirant имеет дополнительное свойство work

// Создать метод getScholarship() для Student, который возвращает сумму стипендии. Если средняя оценка студента больше или равна 5, то сумма 100, иначе 80.

// Переопределить этот метод в Aspirant. Если средняя оценка аспиранта равна 5, то сумма 200, иначе 180.

// Создать несколько объектов типа Student и Aspirant. Создать массив содержащий объекты Student и Aspirant. Вызвать метод getScholarship() для каждого элемента массива.
